tap "gcenx/wine"
tap "homebrew/cask"
tap "homebrew/bundle"
tap "homebrew/cask-versions"
tap "homebrew/core"

brew "awscli"
brew "curl"
brew "docker-compose"
brew "ghq"
brew "git"
brew "go"
brew "goenv"
brew "jq"
brew "mas"
brew "nkf"
brew "node"
brew "nodenv"
brew "peco"
brew "phpenv"
brew "pyenv"
brew "terminal-notifier"
brew "tree"
brew "vim"
brew "wget"
brew "yarn"

cask_args appdir: '/Applications'

tap "adoptopenjdk/openjdk"

cask "alfred"
cask "bettertouchtool"
cask "cheatsheet"
cask "dbeaver-community" #jdkの依存がある
cask "discord"
cask "discord-ptb"
cask "docker"
cask "figma"
cask "firefox"
cask "github"
cask "gitkraken"
cask "google-chrome"
cask "jetbrains-toolbox"
cask "krisp"
cask "loupedeck"
cask "macs-fan-control"
cask "microsoft-edge"
cask "miro"
cask "notion"
cask "spotify"
cask "shureplus-motiv"
cask "visual-studio-code"
cask "zoom"

mas "Bear", id: 1091189122
mas "Kindle", id: 405399194
mas "LINE", id: 539883307
mas "Slack", id: 803453959
mas "The Unarchiver", id: 425424353
mas "Unarchiver", id: 1104175604
mas "Xcode", id: 497799835
