tap "homebrew/cask"
tap "homebrew/bundle"
tap "homebrew/cask-versions"
tap "homebrew/core"

brew "mas"
brew "git"
brew "docker-compose"
brew "curl"
brew "wget"
brew "yarn"
brew "tree"
brew "jq"
brew "nkf"
brew "vim"
brew "go"
brew "goenv"
brew "node"
brew "nodebrew"
brew "pdfpc"
brew "ghq"
brew "peco"

cask_args appdir: '/Applications'

tap "adoptopenjdk/openjdk"

cask "alfred"
cask "dbeaver-community" #jdkの依存がある
cask "discord"
cask "jetbrains-toolbox"
cask "gitkraken"
cask "xmind"
cask "visual-studio-code"
cask "zoomus"
cask "github"
cask "google-chrome"
cask "firefox"
cask "microsoft-edge"

mas "The Unarchiver", id: 425424353
mas "Unarchiver", id: 1104175604
mas "TweetDeck", id: 485812721
mas "GIPHY CAPTURE", id: 668208984
mas "Bear", id: 1091189122
mas "LINE", id: 539883307
mas "Kindle", id: 405399194
mas "Slack", id: 803453959
